#+STARTUP: logdone
#+STARTUP: lognotedone

#+TODO: TODO CURR | DONE
#+TODO: POSTPONED | CANCELED

Time-stamp: <2012-11-05 13:09:37 tony>
Creation:   <2008-09-08 08:06:30 tony>

* Tasks to Do [1/12]

  Usually, we need to load it everything before going on.

#+name: loadit
#+begin_src lisp
  (ql:quickload :cls)
#+end_src

#+RESULTS: loadit
| :CLS |

  and sometimes we might want to recompile fully:

#+name: recompile-it-all
#+begin_src lisp
  (asdf:oos 'asdf:compile-op :cls :force T)
#+end_src

  Currently <2012-10-10 Wed> QuickLisp support doesn't provide a
  recompilation facility.  And QL is built over and partially extends
  ASDF, so we should be fine for now.
** DONE [#B] Example of Custom Data analysis set up
   - State "DONE"       from "CURR"       [2010-10-12 Tue 13:48] \\
     setup is mostly complete
   - State "CURR"       from "TODO"       [2010-10-12 Tue 13:47]
   - State "TODO"       from ""           [2010-10-12 Tue 13:47]

   This is an example of a custom setup, not really interesting at
   this point (it will hopefully be obsolete by the first release)
   except to remind Tony how to program.  Pointy-headed managers need
   any support they can find in order to regress to their
   hacker-childhood.

   The only point of this section is to illustrate that we could want
   to load additional modules that are not a central part of the core
   files.

   <2012-10-29 Mon> Perhaps another point is to demonstrate that we
   might not want certain functionality, or would like to replace
   with different functionality.
   
#+name: CustomLoader
#+begin_src lisp :tangle "examples/CustomLoader.lisp"
  ;; always ensure we are in the right package to leave droppings and access functionality
  (in-package :cl-user) 
  (progn 
    (defun init-CLS (&key (compile 'nil))
      (let ((packagesToLoad (list ;; core system
                                  :lift :lisp-matrix :cls
                                  ;; visualization
                                  ;; :cl-cairo2-x11 :iterate
                                  :cl-2d
                                  ;; doc reporting
                                  :cl-pdf :cl-typesetting
                                  ;;INFRA
                                  :asdf-system-connections :xarray
                                  ;;DOCS
                                  :metatilities-base :anaphora :tinaa
                                  :cl-ppcre :cl-markdown :docudown
                                  ;; version and validate CLOS objects
                                  ;; :versioned-objects :validations
                                  ;;VIZ
                                  ;; :cl-opengl
                                  ;; :cl-glu :cl-glut :cl-glut-examples
  
  
                                  ;; :cells :cells-gtk
                                  :bordeaux-threads)))
        (mapcar #'(lambda (x)
                    (if compile
                        (asdf:oos 'asdf:compile-op x :force T)
                        (asdf:oos 'asdf:load-op x)))
                packagesToLoad)))
    ;; (init-CLS :compile T) vs:
    (init-CLS))
#+end_src

#+results:
|   | #<PACKAGE "COMMON-LISP-USER"> |

*** CURR [#B] Unit tests
    - State "CURR"       from "TODO"       [2010-11-04 Thu 18:33]
    - State "CURR"       from "TODO"       [2010-10-12 Tue 13:48]
    - State "TODO"       from ""           [2010-10-12 Tue 13:48]

    Unit tests have been started using LIFT.  Need to consider some of
    the other systems that provide testing, when people add them to
    the mix of libraries that we need, along with examples of how to
    use.

#+name: ex-cls-unittest
#+begin_src lisp
  (in-package :lisp-stat-unittests)
  (run-tests :suite 'lisp-stat-ut)
#+end_src

#+RESULTS: ex-cls-unittest
: #<Results for LISP-STAT-UT 66 Tests, 3 Failures, 21 Errors>


    Before we removed the internal legacy lispstat probability code,
    we had:

: ;; => tests = 78, failures = 7, errors = 20

    The following needs to be solved in order to have a decent
    installation qualification (IQ) and performance qualification
    (PQ).  It currently fails on approach.

#+name: cls-unittest
#+begin_src lisp
  (in-package :lisp-stat-unittests)
  (asdf:oos 'asdf:test-op 'cls) ; (describe (run-tests :suite 'lisp-stat-ut))
#+end_src

    and check documentation to see if it is useful.

#+name: unittest-ex
#+begin_src lisp
  (in-package :lisp-stat-unittests)
  (describe 'lisp-stat-ut)
  (documentation 'lisp-stat-ut 'type)
  
  ;; FIXME: Example: currently not relevant, yet
  ;;   (describe (lift::run-test :test-case  'lisp-stat-unittests::create-proto
  ;;                             :suite 'lisp-stat-unittests::lisp-stat-ut-proto))
  
  (describe (lift::run-tests :suite 'lisp-stat-ut-dataframe))
  ;; => Test Report for LISP-STAT-UT-DATAFRAME: 11 tests run, 5 Errors.
  
  (lift::run-tests :suite 'lisp-stat-ut-dataframe)
  
  ;;; The following barfs, doesn't like test-case keyword
  ;; (describe (lift::run-test
  ;;             :test-case  'lisp-stat-unittests::create-proto
  ;;             :suite 'lisp-stat-unittests::lisp-stat-ut-proto))
#+end_src

